Public Attributes | List of all members
API_RoofLevelData Struct Reference
Element Manager API
Defines a level of a polyroof plane. This structure is used in API_PolyRoofData. More...
#include <APIdefs_Elements.h>
 Public Attributes
double  | levelHeight
Height of the level.
double  | levelAngle
Angle of planes measured from horizontal on this level.
Detailed Description
Defines a level of a polyroof plane. This structure is used in API_PolyRoofData.
Member Data Documentation
◆ levelAngle
 API_RoofLevelData::levelAngle
Angle of planes measured from horizontal on this level.
◆ levelHeight
 API_RoofLevelData::levelHeight
Height of the level.